app/controllers/admin/users_controller.rb

SELECT `registration_infos`.* FROM `registration_infos` WHERE (`registration_infos`.user_id = 97) LIMIT 1
---
  def index
    @users = User.find( :all,
                        :include => [:registration_info])